ob-sas.org
*** tests
**** test de =make-process=
OK
#+begin_src emacs-lisp
(defun run-sas-direct ()
  "Run an inferior instance of `sas' inside Emacs."
  (interactive)
  (let* ((sas-program sas-cli-file-path))
    ;; pop to the "*sas*" buffer if the process is dead, the
    ;; buffer is missing or it's got the wrong mode.
    (make-process (list :name "sas" :buffer (generate-new-buffer "*sas*")
                        :command (list "/usr/local/bin/sas_u8" "-nodms" "-nonews" "-stdio"
                                       "-nofullstimer" "-nodate" "-nocenter"
                                       "-terminal" "-pagesize" "max"
                                       "-nosyntaxcheck")
                        :stderr (generate-new-buffer "*sas-errors*")))
    ))
#+end_src
#+begin_src emacs-lisp
(apply #'make-process (list :name "sas" :buffer (generate-new-buffer "*sas*")
                        :command (list "/usr/local/bin/sas_u8" "-nodms" "-nonews" "-stdio"
                            "-nofullstimer" "-nodate" "-nocenter"
                            "-terminal" "-pagesize" "max"
                            "-nosyntaxcheck")
                        :stderr (generate-new-buffer "*sas-errors*")))
#+end_src

#+RESULTS:
: #<process sas>

**** ouverture
#+begin_src emacs-lisp :results none
(run-sas)
#+end_src
#+begin_src emacs-lisp :results output
(list-processes)
(process-list)
(message "proc : %s" (comint-check-proc "*sas*"))
#+end_src

#+RESULTS:

#+begin_src emacs-lisp :results output
(run-sas-direct)
#+end_src
#+begin_src emacs-lisp
(make-process :name "sas" :buffer (generate-new-buffer "*sas*")
                        :command (list "/usr/local/bin/sas_u8" "-nodms" "-nonews" "-stdio"
                            "-nofullstimer" "-nodate" "-nocenter"
                            "-terminal" "-pagesize" "max"
                            "-nosyntaxcheck")
                        :stderr (generate-new-buffer "*sas-errors*"))
#+end_src

#+RESULTS:
: #<process sas>

**** envoi string: fermeture
#+begin_src emacs-lisp :results output
(comint-send-string "*sas*" "endsas;\n")
#+end_src

#+RESULTS:

#+begin_src emacs-lisp :results output
(process-send-string "sas" "endsas;\n")
#+end_src

#+RESULTS:

**** envoi d'une proc
#+begin_src emacs-lisp :results output
;(comint-send-string "*sas*" "proc setinit;\n run;\n")
(comint-send-string "*sas*" "data a; v=1; run; proc print data=a; run;\n")
#+end_src

#+RESULTS:

#+begin_src emacs-lisp :results output
;(process-send-string (get-process "*sas*")  "proc setinit;\n run;\n")
(process-send-string "sas"  "data a; v=1; run; proc print data=a; run;\n")
(while (accept-process-output (get-process "*sas*") ))
(while (accept-process-output (get-process "*sas errors*")))
#+end_src

#+RESULTS:

**** test buffer vivant
#+begin_src emacs-lisp
(require 'ob-comint)
(message "yes %s" (org-babel-comint-buffer-livep "*sas*"))
#+end_src

#+RESULTS:
: yes nil

**** test vivant
#+begin_src emacs-lisp
(require 'ob-comint)
(message "yes %s" (get-buffer-process  (get-buffer "*sas*")))
#+end_src

#+RESULTS:
: yes t

**** test envoi via ob-comint
#+begin_src emacs-lisp
(require 'ob-comint)
;; (org-babel-comint-in-buffer (get-buffer "*sas*") "proc setinit;\n run;\n")
(with-current-buffer
 (switch-to-buffer "*sas*" )
 (org-babel-comint-input-command "*sas*" "proc setinit;\n run;\n"))
#+end_src

#+RESULTS:
: proc setinit;
:  run;
**** test envoi via ob-commint
#+begin_src emacs-lisp
(let* ((org-babel-sas-eoe-indicator
        "data eoe_org_data;\n nbabelvareoe=1;\nrun;\nproc print data=eoe_org_data;\nrun;\n")
       (full-body (concat "proc setinit; run;\n" org-babel-sas-eoe-indicator)))
  (with-current-buffer
      (switch-to-buffer "*sas*")
    (org-babel-comint-input-command "*sas*" full-body)))
#+end_src
* async
** ipython
https://github.com/gregsexton/ob-ipython/blob/master/ob-ipython.el
** ob-async
https://github.com/astahlman/ob-async
base sur
https://github.com/jwiegley/emacs-async

* ob-sas.el
** header
 #+BEGIN_SRC elisp :tangle ob-sas.el
 ;;; ob-sas.el --- org-babel functions for sas code evaluation

 ;; Copyright (C) 2019 P.A. Cornillon
 ;; Author: P.A. Cornillon
 ;;      G. Jay Kerns
 ;;      Eric Schulte
 ;;      Dan Davison


 ;; This file is not part of GNU Emacs.

 ;; This program is free software; you can redistribute it and/or modify
 ;; it under the terms of the GNU General Public License as published by
 ;; the Free Software Foundation; either version 3, or (at your option)
 ;; any later version.
 ;;
 ;; This program is distributed in the hope that it will be useful,
 ;; but WITHOUT ANY WARRANTY; without even the implied warranty of
 ;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 ;; GNU General Public License for more details.
 ;;
 ;; You should have received a copy of the GNU General Public License
 ;; along with GNU Emacs; see the file COPYING.  If not, write to the
 ;; Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor,
 ;; Boston, MA 02110-1301, USA.

 ;;; Commentary:

 ;; The file provides Org-Babel support for evaluating sas code.  It is
 ;; basically the adaptation of
 ;; ob-R.el by E. Schulte which results of find-and-replace "julia" by "sas" in
 ;; ob-julia.el by G. Jay Kerns.
 ;; see
 ;; https://github.com/Pierre-Andre/Org-Babel-sas
 ;;; Requirements:
 ;; Sas: http://sas.com
 ;; ESS: http://ess.r-project.org (only for session in unix/linux)
 #+END_SRC
** include
 #+BEGIN_SRC  elisp :tangle ob-sas.el
 ;;; Code:
 (require 'ob)
 (require 'cl-lib)

 (declare-function orgtbl-to-csv "org-table" (table params))
 (declare-function sas "ext:ess-sas" (&optional start-args))
 (declare-function inferior-ess-send-string "ext:ess-inf" ())
 (declare-function ess-make-buffer-current "ext:ess-inf" ())
 (declare-function ess-eval-buffer "ext:ess-inf" (vis))
 (declare-function org-number-sequence "org-compat" (from &optional to inc))
 #+END_SRC
** Custom Variables
 #+BEGIN_SRC   elisp :tangle ob-sas.el
 ;;;;;;;;;;;;;;;; could be useful to increase or decrease timeout ....
 (defcustom org-babel-sas-timeout 1000
   "Timeout (in sec) used when waiting output from a submitted src block (to sas) with argument :session."
   :group 'org-babel
   :type 'integer)
 ;;;;;;;;;;;;;;;; could be useful to tweak printing page size
 (defcustom org-babel-sas-print-options "options formdlim='' pagesize=max nocenter nodate;\n"
   "general options used to have the maximum page size"
   :group 'org-babel
   :type 'string)

 ;;;;;;;;;;;;;;;; where is SAS (for :session "none" or :session
 (defcustom org-babel-sas-command "/usr/local/bin/sas_u8"
 ;  inferior-SAS-program-name
   "Command name to use for executing sas code."
   :group 'org-babel
   :type 'string)
 ;;;;;;;;;;;;;;; command line option to be used with SAS (for :session "none")
 (defcustom org-babel-sas-command-options
   "-formdlim='' -pagesize=max -nonumber -nodate -nocenter -nonews -nodms"
   "Options for sas batch"
   :group 'org-babel
   :type 'string)

 ;;;;;;;;;;;;;;; windows SAS or not
 (defcustom org-babel-sas-windows
   nil
   "SAS on windows (non nil)  or not (nil)"
   :group 'org-babel
   :type 'boolean)
 ;;;;;;;;;;;;;;; real session or not (user library)
 (defcustom org-babel-sas-realsession
   nil
   "is the :session will use ESS to make a real session (non nil, unix only)
    or use a user library (nil)"
   :group 'org-babel
   :type 'boolean)
 ;;;;;;;;;;;;;;; custom log file name (for :session "none")
 (defcustom org-babel-sas-logfile-name
   nil
   "Optionnal log-file name for :session none"
   :group 'org-babel
   :type 'string)
 #+END_SRC
** Utilities
 #+BEGIN_SRC   elisp :tangle ob-sas.el
 ;;;;;;;;;;;;;;;;;;;;;;;;;;;
 ;; global alist to take care of previous commands done in session
 (defvar org-babel-sas-lepoint (list (cons "sessionSAS" 1)))
 ;; small sas program sent to sas after the actual sas chunk
 ;; this define the end signal
 (defvar org-babel-sas-eoe-indicator "data eoe_org_data;\n nbabelvareoe=1;\nrun;\nOPTIONS NODATE NONUMBER;\nTITLE1;\nTITLE2;\nproc print data=eoe_org_data;\nrun;")
 ;; output of the corresponding small program
 ;; when seen it means that all the chunk is done
 (defvar org-babel-sas-eoe-output "Obs.    nbabelvareoe[ \n]+1[ ]+1")
 ;; cursor to be trimmed
 (defvar org-babel-sas-boe-output "$ tty\n/dev/pts/[0-9]+\n\\$")
 ;; header stuff
 (defconst org-babel-header-args:sas
   '((hsize		 . :any)
     (vsize		 . :any)
     (xpixels		 . :any)
     (ypixels		 . :any)
     (border		 . :any)
     (width		 . :any)
     (height		 . :any)
     (sastab		 . :any)
     (results             . ((file list vector table scalar verbatim)
			     (raw org html latex code pp wrap)
			     (replace silent append prepend)
			     (output value graphics odsgraphics log))))
   "sas-specific header arguments.")

 (add-to-list 'org-babel-tangle-lang-exts '("sas" . "sas"))

 ;; session using ESS is the way to go, so make that the default
 (defvar org-babel-default-header-args:sas '((:results . "output") (:session . nil)))

 ;; from unix to windows path (ie change / to \)
 (defun org-babel-sas-path-windows (s)
   "replace / by \\"
    (replace-regexp-in-string "/" "\\\\" s))
 ;; trim white space and garbage
 (defun org-babel-sas-trim-white (s)
   "replace S by empty string if S is whitespace/tab/CR only"
   (if (string-match "\\`[ \t\n\r]+\\'" s)
       (replace-match "" t t s)
     s))
 (defun org-babel-sas-trim-doubleline (s)
   "replace elo eol by eol"
   (if (string-match "\n\n" s)
       (replace-match "\n" t t s)
     s))
 (defun org-babel-sas-trim-end (s)
   "replace eol + white by eol"
   (if (string-match "\n[ ]+\\'" s)
       (replace-match "\n" t t s)
     s))
 (defun org-babel-sas-trim-begin (s)
   "replace eol by empty string"
   (if (string-match "\\`\n" s)
       (replace-match "" t t s)
     s))
 #+END_SRC
