ob-sas.el
;;; ob-sas.el --- org-babel functions for sas code evaluation

;; Copyright (C) 2017 P.A. Cornillon
;; Author: P.A. Cornillon
;;      G. Jay Kerns
;;      Eric Schulte
;;      Dan Davison


;; This file is not part of GNU Emacs.

;; This program is free software; you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation; either version 3, or (at your option)
;; any later version.
;;
;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.
;;
;; You should have received a copy of the GNU General Public License
;; along with GNU Emacs; see the file COPYING.  If not, write to the
;; Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor,
;; Boston, MA 02110-1301, USA.

;;; Commentary:

;; The file provides Org-Babel support for evaluating sas code.  It is
;; basically result of find-and-replace "julia" by "sas" in
;; ob-julia.el by G. Jay Kerns.
;; see 
;; https://github.com/Pierre-Andre/Org-Babel-sas
;;; Requirements:
;; Sas: http://sas.com
;; ESS: http://ess.r-project.org (for session in unix/linux)

;;; Code:
(require 'ob)
(require 'cl-lib)

(declare-function orgtbl-to-csv "org-table" (table params))
(declare-function sas "ext:ess-sas" (&optional start-args))
(declare-function inferior-ess-send-string "ext:ess-inf" ())
(declare-function ess-make-buffer-current "ext:ess-inf" ())
(declare-function ess-eval-buffer "ext:ess-inf" (vis))
(declare-function org-number-sequence "org-compat" (from &optional to inc))
;;;;;;;;;;;;;;;; could be useful to increase or decrease timeout ....
(defcustom org-babel-sas-timeout 1000
  "Timeout (in sec) used when waiting output from a submitted src block (to sas) with argument :session."
  :group 'org-babel
  :type 'integer)
;;;;;;;;;;;;;;;; could be useful to tweak printing page size
(defcustom org-babel-sas-print-options "options formdlim='' pagesize=max nocenter nodate;\n"
  "general options used to have the maximum page size"
  :group 'org-babel
  :type 'string)

;;;;;;;;;;;;;;;; where is SAS (for :session "none")
(defcustom org-babel-sas-command "/usr/local/bin/sas_u8"
;  inferior-SAS-program-name
  "Command name to use for executing sas code."
  :group 'org-babel
  :type 'string)
;;;;;;;;;;;;;;; command line option to be used with SAS (for :session "none")
(defcustom org-babel-sas-command-options
  "-formdlim='' -pagesize=max -nonumber -nodate -nocenter -nonews -nodms"
  "Options for sas batch"
  :group 'org-babel
  :type 'string)
  
;;;;;;;;;;;;;;; windows SAS or not
(defcustom org-babel-sas-windows
  nil
  "SAS on windows (non nil)  or not (nil)"
  :group 'org-babel
  :type 'boolean)
;;;;;;;;;;;;;;; custom log file name (for :session "none")
(defcustom org-babel-sas-logfile-name
  nil
  "Optionnal log-file name for :session none"
  :group 'org-babel
  :type 'string)

;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; global alist to take care of previous commands done in session
(defvar org-babel-sas-lepoint (list (cons "sessionSAS" 1)))
;; small sas program sent to sas after the actual sas chunk
;; this define the end signal
(defvar org-babel-sas-eoe-indicator "data eoe_org_data;\n nbabelvareoe=1;\nrun;\nOPTIONS NODATE NONUMBER;\nTITLE1;\nTITLE2;\nproc print data=eoe_org_data;\nrun;")
;; output of the corresponding small program
;; when seen it means that all the chunk is done
(defvar org-babel-sas-eoe-output "Obs.    nbabelvareoe[ \n]+1[ ]+1")
;; cursor to be trimmed
(defvar org-babel-sas-boe-output "$ tty\n/dev/pts/[0-9]+\n\\$")
;; header stuff
(defconst org-babel-header-args:sas
  '((hsize		 . :any)
    (vsize		 . :any)
    (xpixels		 . :any)
    (ypixels		 . :any)
    (border		 . :any)
    (width		 . :any)
    (height		 . :any)
    (sastab		 . :any)
    (results             . ((file list vector table scalar verbatim)
			    (raw org html latex code pp wrap)
			    (replace silent append prepend)
			    (output value graphics odsgraphics))))
  "sas-specific header arguments.")

(add-to-list 'org-babel-tangle-lang-exts '("sas" . "sas"))

;; session using ESS is the way to go, so make that the default
(defvar org-babel-default-header-args:sas '((:results . "output") (:session . nil)))

;; trim white space and garbage
(defun org-babel-sas-trim-white (s)
  "replace S by empty string if S is whitespace only"
  (if (string-match "\\`[ \t\n\r]+\\'" s)
      (replace-match "" t t s)
    s))
(defun org-babel-sas-trim-doubleline (s)
  "replace S by empty string if S is whitespace only"
  (if (string-match "\n\n" s)
      (replace-match "\n" t t s)
    s))
(defun org-babel-sas-trim-end (s)
  "replace S by empty string if S is whitespace only"
  (if (string-match "\n[ ]+\\'" s)
      (replace-match "\n" t t s)
    s))
(defun org-babel-sas-trim-begin (s)
  "replace S by empty string if S is whitespace only"
  (if (string-match "\\`\n" s)
      (replace-match "" t t s)
    s))
;; let's go: main function
