ob-sas.el
  "Evaluate BODY in external sas process.
If RESULT-TYPE equals 'output then return standard output as a
string.  If RESULT-TYPE equals 'value then return the value of the
last statement in BODY, as elisp."
  (cl-case result-type
    (value
     ;; org-babel-eval does pass external argument...
     (let ((tmp-file (org-babel-temp-file "SAS-")))
	   ;;((tmp-file "sas-file4677846547.sas")
       ;;(directory-sas ""))
       (with-current-buffer
	   (switch-to-buffer (get-buffer-create (concat tmp-file ".sas")))
	 (set-visited-file-name (concat tmp-file ".sas"))
	 (insert body)
	 (save-buffer 0))
       (shell-command (if org-babel-sas-windows
			  (format "%s -SYSIN %s -NOSPLASH -NOICON -PRINT %s -LOG %s"
			      org-babel-sas-command 
			      (concat tmp-file ".sas")
			      (concat tmp-file ".lst")
			      (if org-babel-sas-logfile-name
				  org-babel-sas-logfile-name
				(concat tmp-file ".log")))
			  (format "%s %s -log %s -print %s %s"
			      org-babel-sas-command org-babel-sas-command-options
			      (if org-babel-sas-logfile-name
				  org-babel-sas-logfile-name
				(concat tmp-file ".log"))
			      (concat tmp-file ".lst")
			      (concat tmp-file ".sas"))) nil nil)
       (kill-buffer (file-name-nondirectory (concat tmp-file ".sas")))
       (delete-file (concat tmp-file ".sas"))
       (if (file-readable-p sastab-tmp-file)
	   (org-babel-result-cond result-params
	     (org-babel-chomp
	      (with-current-buffer (find-file-noselect sastab-tmp-file)
		(buffer-string))
	      "\n")
	     (org-babel-import-elisp-from-file sastab-tmp-file '(16)))
	 (progn
	   (if (get-buffer (if org-babel-sas-logfile-name
				  org-babel-sas-logfile-name
				(concat tmp-file ".log")))
	       (with-current-buffer (get-buffer  (if org-babel-sas-logfile-name
						     org-babel-sas-logfile-name
						   (concat tmp-file ".log")))
		 (revert-buffer :ignore-auto :noconfirm :preserve-modes))
	     (save-window-excursion (pop-to-buffer-same-window (find-file-noselect (if org-babel-sas-logfile-name
						     org-babel-sas-logfile-name
						   (concat tmp-file ".log"))))))
	   (format "Errors, please see [[file://%s][log file]] (in Buffer list)" (if org-babel-sas-logfile-name
						     org-babel-sas-logfile-name
						   (concat tmp-file ".log")))))))     
    (output
     ;; org-babel-eval does pass external argument...
     (let ((tmp-file (org-babel-temp-file "SAS-")))
	   ;;((tmp-file "sas-file4677846547.sas")
       ;;(directory-sas ""))
       (with-current-buffer
	   (switch-to-buffer (get-buffer-create (concat tmp-file ".sas")))
	 (set-visited-file-name (concat tmp-file ".sas"))
	 (insert body)
	 (save-buffer 0))
       (shell-command (if org-babel-sas-windows
			(format "%s -SYSIN %s -NOSPLASH -NOICON -PRINT %s -LOG %s"
			      org-babel-sas-command 
			      (concat tmp-file ".sas")
			      (concat tmp-file ".lst")
			      (if org-babel-sas-logfile-name
				  org-babel-sas-logfile-name
				(concat tmp-file ".log")))
			  (format "%s %s -log %s -print %s %s"
			      org-babel-sas-command org-babel-sas-command-options
			      (if org-babel-sas-logfile-name
				  org-babel-sas-logfile-name
				(concat tmp-file ".log"))
			      (concat tmp-file ".lst")
			      (concat tmp-file ".sas"))) nil nil)
       (kill-buffer (file-name-nondirectory (concat tmp-file ".sas")))
       (delete-file (concat tmp-file ".sas"))
       (if (file-readable-p (concat tmp-file ".lst"))
	   (progn
	     (with-current-buffer
		 (switch-to-buffer (find-file-noselect (concat tmp-file ".lst")))
	       (beginning-of-buffer)
	       (setq body (buffer-string)))
	      (kill-buffer (file-name-nondirectory (concat tmp-file ".lst")))
	     (delete-file  (concat tmp-file ".lst"))
	     body)
	 (progn
	   (if (get-buffer (if org-babel-sas-logfile-name
				  org-babel-sas-logfile-name
				(concat tmp-file ".log")))
	       (with-current-buffer (get-buffer  (if org-babel-sas-logfile-name
						     org-babel-sas-logfile-name
						   (concat tmp-file ".log")))
		 (revert-buffer :ignore-auto :noconfirm :preserve-modes))
	     (save-window-excursion (pop-to-buffer-same-window (find-file-noselect (if org-babel-sas-logfile-name
						     org-babel-sas-logfile-name
						   (concat tmp-file ".log"))))))
	   (format "Errors, please see [[file://%s][log file]] (in Buffer list)" (if org-babel-sas-logfile-name
						     org-babel-sas-logfile-name
						   (concat tmp-file ".log")))))))))

(defun org-babel-sas-evaluate-session
    (session body result-type result-params sastab-tmp-file)
