ob-sas.org
*** evaluation in an ess session
 Using ess, SAS commands can be sent to sas (without closing it). This
 function submits the full-body and get results or output
 #+BEGIN_SRC elisp :tangle ob-sas.el
 (defun org-babel-sas-evaluate-session
     (session body result-type result-params sastab-tmp-file)
   "Evaluate BODY in SESSION.
 If RESULT-TYPE equals 'output then return standard output as a
 string.  If RESULT-TYPE equals 'value then return the value of the
 last statement in BODY, as elisp."
   (cl-case result-type
     (value
      ;;     (let* ((allowed-args '(:sastab))
      (let ((org-babel-sas-ess-process-name  (process-name (get-buffer-process session))))
       (with-temp-buffer
	 (insert body)
	 (let ((ess-local-process-name
		(process-name (get-buffer-process session)))
	       (ess-eval-visibly-p nil))
	   (ess-eval-buffer nil)))
       (ess-send-string (get-process org-babel-sas-ess-process-name) org-babel-sas-eoe-indicator)
       ;;    excursion for cut/paste results from output buffer
       ;;   as output buffer is not the same as session buffer
       ;; org-babel-comint-with-output cannot be used
       (save-excursion
      	 (set-buffer (format "*%s.lst*" org-babel-sas-ess-process-name))
      	 (let* ((a 0) (b 0) (ancienpoint (cdr (assoc (concat "session-" (if (stringp session) session (buffer-name session))) org-babel-sas-lepoint))))
      	  (while (< a org-babel-sas-timeout)
      	    (setq b a)
      	    (goto-char (cdr (assoc (concat "session-" (if (stringp session) session (buffer-name session))) org-babel-sas-lepoint)))
      	    (setq a (re-search-forward org-babel-sas-eoe-output nil t))
      	    (if a
      		(progn (setq a org-babel-sas-timeout)
      	 	       (goto-char (cdr (assoc (concat "session-" (if (stringp session) session (buffer-name session))) org-babel-sas-lepoint)))
      	 	       (setq ancienpoint (cdr (assoc (concat "session-" (if (stringp session) session (buffer-name session))) org-babel-sas-lepoint)))
		       ;; well well, this is embarassing but
		       ;; as there's not history like in comint
		       ;; the last point is saved in this global
		       ;; alist variable (that will be used the
		       ;; next time)
      	 	       (setf (cdr (assoc (concat "session-" (if (stringp session) session (buffer-name session))) org-babel-sas-lepoint)) (point-max)))
      	      (setq a (+ b 1)))
      	    (sit-for 0.01)))))
       ;; get export value from sastab-tmp-file
       (org-babel-result-cond result-params
	 (org-babel-chomp
	  (with-current-buffer (find-file-noselect sastab-tmp-file)
	    (buffer-string)
	    )
	  "\n")
	 (org-babel-import-elisp-from-file sastab-tmp-file '(16))))
     (output
      ;; submit body through a temp buffer (in order to not go
      ;; beyond the limit of 500 bytes)
      ;; see
      ;; https://stat.ethz.ch/pipermail/ess-help/2015-April/010518.html
     (let ((org-babel-sas-ess-process-name  (process-name (get-buffer-process session))))
       (with-temp-buffer
	 (insert body)
	 (let ((ess-local-process-name
		(process-name (get-buffer-process session)))
	       (ess-eval-visibly-p nil))
	   (ess-eval-buffer nil)))
       (ess-send-string (get-process org-babel-sas-ess-process-name) org-babel-sas-eoe-indicator)
       ;;    excursion for cut/paste results from output buffer
       ;;   as output buffer is not the same as session buffer
       ;; org-babel-comint-with-output cannot be used
       (save-excursion
      	 (set-buffer (format "*%s.lst*" org-babel-sas-ess-process-name))
      	 (let* ((a 0) (b 0) (ancienpoint (cdr (assoc (concat "session-" (if (stringp session) session (buffer-name session))) org-babel-sas-lepoint))))
      	  (while (< a org-babel-sas-timeout)
      	    (setq b a)
      	    (goto-char (cdr (assoc (concat "session-" (if (stringp session) session (buffer-name session))) org-babel-sas-lepoint)))
      	    (setq a (re-search-forward org-babel-sas-eoe-output nil t))
      	    (if a
      		(progn (setq a org-babel-sas-timeout)
      	 	       (goto-char (cdr (assoc (concat "session-" (if (stringp session) session (buffer-name session))) org-babel-sas-lepoint)))
      	 	       (setq ancienpoint (cdr (assoc (concat "session-" (if (stringp session) session (buffer-name session))) org-babel-sas-lepoint)))
		       ;; well well, this is embarassing but
		       ;; as there's not history like in comint
		       ;; the last point is saved in this global
		       ;; alist variable (that will be used the
		       ;; next time)
      	 	       (setf (cdr (assoc (concat "session-" (if (stringp session) session (buffer-name session))) org-babel-sas-lepoint)) (point-max)))
      	      (setq a (+ b 1)))
      	    (sit-for 0.01))
       	  (org-babel-chomp (org-babel-sas-trim-end (org-babel-sas-trim-begin (org-babel-sas-trim-doubleline (org-babel-sas-trim-white (replace-regexp-in-string (concat "\\(\f\\)\\|\\(" org-babel-sas-boe-output "\\)\\|\\(" org-babel-sas-eoe-output "\\)") "" (buffer-substring ancienpoint (cdr (assoc (concat "session-" (if (stringp session) session (buffer-name session))) org-babel-sas-lepoint)))))))))))))))
 #+END_SRC
** end of file
 #+BEGIN_SRC elisp :tangle ob-sas.el
 (provide 'ob-sas)

 ;;; ob-sas.el ends here
 #+END_SRC
** Old stuff
 #+BEGIN_SRC elisp
 ;;;;;;;;;;;;;;;;;;; two functions not used (at the moment ?)
 (defun org-babel-sas-associate-session (session)
   "Associate sas code buffer with a sas session.
 Make SESSION be the inferior ESS process associated with the
 current code buffer."
   (setq ess-local-process-name
	 (process-name (get-buffer-process session)))
   (ess-make-buffer-current))

 (defun org-babel-load-session:sas (session body params)
   "Load BODY into SESSION."
   (save-window-excursion
     (let ((buffer (org-babel-prep-session:sas session params)))
       (with-current-buffer buffer
         (goto-char (process-mark (get-buffer-process (current-buffer))))
         (insert (org-babel-chomp body)))
       buffer)))
 ;;;;;;;;;;;;;;;;;;; end of not used
 #+END_SRC

* dot Emacs
#+BEGIN_SRC elisp :tangle example_windows.emacs
;; loading ob-sas
(load "Z:/ob-sas.el")
(require 'ob-sas)
;(require 'ob-R)
;; adding sas language to org babel
(org-babel-do-load-languages
 'org-babel-load-languages
 '((sas . t) ))
;; variable for ob-sas
(setq org-babel-sas-windows t)
(setq org-babel-sas-realsession nil)
(setq org-babel-sas-command "C:\\Progra~1\\SASHome\\SASFoundation\\9.4\\sas.exe")
;; no confirmation for evaluation
(setq org-confirm-babel-evaluate nil)
;; fontify source block (with ess it leading to syntax coloration)
(setq org-src-fontify-natively t)
#+END_SRC
