ob-sas.el
  "Evaluate BODY in SESSION.
If RESULT-TYPE equals 'output then return standard output as a
string.  If RESULT-TYPE equals 'value then return the value of the
last statement in BODY, as elisp."
  (cl-case result-type
    (value
     ;;     (let* ((allowed-args '(:sastab))
     (let ((org-babel-sas-ess-process-name  (process-name (get-buffer-process session))))
      (with-temp-buffer
	(insert body)
	(let ((ess-local-process-name
	       (process-name (get-buffer-process session)))
	      (ess-eval-visibly-p nil))
	  (ess-eval-buffer nil)))
      (ess-send-string (get-process org-babel-sas-ess-process-name) org-babel-sas-eoe-indicator)
      ;;    excursion for cut/paste results from output buffer
      ;;   as output buffer is not the same as session buffer
      ;; org-babel-comint-with-output cannot be used 
      (save-excursion
      	(set-buffer (format "*%s.lst*" org-babel-sas-ess-process-name))
      	(let* ((a 0) (b 0) (ancienpoint (cdr (assoc (concat "session-" (if (stringp session) session (buffer-name session))) org-babel-sas-lepoint))))
      	 (while (< a org-babel-sas-timeout)
      	   (setq b a)
      	   (goto-char (cdr (assoc (concat "session-" (if (stringp session) session (buffer-name session))) org-babel-sas-lepoint)))
      	   (setq a (re-search-forward org-babel-sas-eoe-output nil t))
      	   (if a
      	       (progn (setq a org-babel-sas-timeout)
      	 	      (goto-char (cdr (assoc (concat "session-" (if (stringp session) session (buffer-name session))) org-babel-sas-lepoint)))
      	 	      (setq ancienpoint (cdr (assoc (concat "session-" (if (stringp session) session (buffer-name session))) org-babel-sas-lepoint)))
		      ;; well well, this is embarassing but
		      ;; as there's not history like in comint
		      ;; the last point is saved in this global
		      ;; alist variable (that will be used the
		      ;; next time)
      	 	      (setf (cdr (assoc (concat "session-" (if (stringp session) session (buffer-name session))) org-babel-sas-lepoint)) (point-max)))
      	     (setq a (+ b 1)))
      	   (sit-for 0.01)))))
      ;; get export value from sastab-tmp-file
      (org-babel-result-cond result-params
	(org-babel-chomp
	 (with-current-buffer (find-file-noselect sastab-tmp-file)
;	   (message ": %s" (buffer-string))
	   (buffer-string)
	   )
	 "\n")
	(org-babel-import-elisp-from-file sastab-tmp-file '(16))))
    (output
     ;; submit body through a temp buffer (in order to not go
     ;; beyond the limit of 500 bytes)
     ;; see 
     ;; https://stat.ethz.ch/pipermail/ess-help/2015-April/010518.html
    (let ((org-babel-sas-ess-process-name  (process-name (get-buffer-process session))))
      (with-temp-buffer
	(insert body)
	(let ((ess-local-process-name
	       (process-name (get-buffer-process session)))
	      (ess-eval-visibly-p nil))
	  (ess-eval-buffer nil)))
      (ess-send-string (get-process org-babel-sas-ess-process-name) org-babel-sas-eoe-indicator)
      ;;    excursion for cut/paste results from output buffer
      ;;   as output buffer is not the same as session buffer
      ;; org-babel-comint-with-output cannot be used 
      (save-excursion
      	(set-buffer (format "*%s.lst*" org-babel-sas-ess-process-name))
      	(let* ((a 0) (b 0) (ancienpoint (cdr (assoc (concat "session-" (if (stringp session) session (buffer-name session))) org-babel-sas-lepoint))))
      	 (while (< a org-babel-sas-timeout)
      	   (setq b a)
      	   (goto-char (cdr (assoc (concat "session-" (if (stringp session) session (buffer-name session))) org-babel-sas-lepoint)))
      	   (setq a (re-search-forward org-babel-sas-eoe-output nil t))
      	   (if a
      	       (progn (setq a org-babel-sas-timeout)
      	 	      (goto-char (cdr (assoc (concat "session-" (if (stringp session) session (buffer-name session))) org-babel-sas-lepoint)))
      	 	      (setq ancienpoint (cdr (assoc (concat "session-" (if (stringp session) session (buffer-name session))) org-babel-sas-lepoint)))
		      ;; well well, this is embarassing but
		      ;; as there's not history like in comint
		      ;; the last point is saved in this global
		      ;; alist variable (that will be used the
		      ;; next time)
      	 	      (setf (cdr (assoc (concat "session-" (if (stringp session) session (buffer-name session))) org-babel-sas-lepoint)) (point-max)))
      	     (setq a (+ b 1)))
      	   (sit-for 0.01))
       	 (org-babel-chomp (org-babel-sas-trim-end (org-babel-sas-trim-begin (org-babel-sas-trim-doubleline (org-babel-sas-trim-white (replace-regexp-in-string (concat "\\(\f\\)\\|\\(" org-babel-sas-boe-output "\\)\\|\\(" org-babel-sas-eoe-output "\\)") "" (buffer-substring ancienpoint (cdr (assoc (concat "session-" (if (stringp session) session (buffer-name session))) org-babel-sas-lepoint)))))))))))))))

(provide 'ob-sas)

;;; ob-sas.el ends here
